// 折线分割平面.cpp : 定义控制台应用程序的入口点。
//
//n条直线最多分平面问题
//n-1条直线将平面分为f(n-1)块，第n条直线要将平面分为最多份数，与n-1条直线的交点最多可以有n-1个
//n-1个交点会产生最多2条射线和n-2条线段，每条射线或者线段将原来的区域一分为二，则在f(n-1)的基础上增加了n-2+2个区域
//f(n)=f(n-1)+(n-2)+2=f(n-1)+n

//n条折线最多分平面问题
//n-1条折线将平面分为f(n-1)块，第n条折线要将平面分为最多分数，则第n条折线的两条边与前n-1条折线的两条边相交
//产生2*2*(n-1)个交点，这些交点会产生4*(n-1)条线段和2条射线，每条射线或者线段将原来的区域一分为二，但是需要注意，折线本身的两条线段合起来只增加原来区域的一份
//则在f(n-1)的基础上增加了4*(n-1)+2-1个区域
//f(n)=f(n-1)+4*(n-1)+1
#include<iostream>
using namespace std;


int main()
{
	int n;
	cin >> n;
	long long s[100] = { 0,2,7 };
	for (int i = 3; i < 100; i++)
	{
		s[i] = s[i - 1] + 4 * (i - 1) + 1;
	}
	while (n-- &&n!=EOF)
	{
		int x;
		cin >> x;
		cout << s[x] << endl;
	}
    return 0;
}

